<h1>Exercise 34</h1>
<p>Write a query to find the median salary of each company. Bonus point if you can solve the question by not using any built/in SQL functions.</p>
<strong>Expected outcome:</strong>
<br>
<img src="Day-34-Expected_Output.png" width="200">

In [1]:
import sqlite3
import pandas as pd

db_name="exercise24.db"
conn=sqlite3.connect(db_name)
cursor=conn.cursor()

cursor.execute("""CREATE TABLE IF NOT EXISTS employee(emp_id INT, company VARCHAR(10), salary INT)""")
conn.commit()

emp_data=[
    (1,'A',2341),
    (2,'A',341),
    (3,'A',15),
    (4,'A',15314),
    (5,'A',451),
    (6,'A',513),
    (7,'B',15),
    (8,'B',13),
    (9,'B',1154),
    (10,'B',1345),
    (11,'B',1221),
    (12,'B',234),
    (13,'C',2345),
    (14,'C',2645),
    (15,'C',2645),
    (16,'C',2652),
    (17,'C',65)
]
cursor.executemany("INSERT INTO employee VALUES(?,?,?)",emp_data)

querytoexec="SELECT * FROM employee"
df=pd.read_sql(querytoexec,conn)
print(df)

    emp_id company  salary
0        1       A    2341
1        2       A     341
2        3       A      15
3        4       A   15314
4        5       A     451
5        6       A     513
6        7       B      15
7        8       B      13
8        9       B    1154
9       10       B    1345
10      11       B    1221
11      12       B     234
12      13       C    2345
13      14       C    2645
14      15       C    2645
15      16       C    2652
16      17       C      65

In [2]:
querytoexec="SELECT company, AVG(salary) FROM (SELECT *, row_number() OVER(PARTITION BY company ORDER BY salary) AS rn, COUNT(1) OVER (PARTITION BY company) AS total_cnt FROM employee) AS a WHERE rn BETWEEN total_cnt * 1.0 / 2 AND total_cnt * 1.0/ 2 + 1 GROUP BY company"
df=pd.read_sql(querytoexec,conn)
print(df)

  company  AVG(salary)
0       A        482.0
1       B        694.0
2       C       2645.0